Revit 2027 API
ParameterTypeId.MaterialAssetParamSourceUrl Property
 "Source URL"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAssetParamSourceUrl { get; }
Public Shared ReadOnly Property MaterialAssetParamSourceUrl As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAssetParamSourceUrl {
	ForgeTypeId^ get ();
}
static member MaterialAssetParamSourceUrl : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace